.equ F_CPU = 4000000
;-----------------------------------------------------------------------------
IIC_INIT:
	push R23
	ldi r23, 0b00000000; делитель 0
	out TWSR, r23
	ldi R23, 0xC0
    out TWBR,R23 ; 12 - 100кГц для 4Мгц
	pop R23
RET
;-----------------------------------------------------------------------------
; Даем старт на линию I2C
IIC_START:	
		OUTI	TWCR,1<<TWINT|1<<TWSTA|1<<TWEN|0<<TWIE
 
IIC_S:		
		IN	OSRG,TWCR
		ANDI	OSRG,1<<TWINT			
		BREQ	IIC_S		; Ждем пока передатчик IIC выполнит старт
		RET
 
;-----------------------------------------------------------------------------
;Посылаем байт по IIC 
IIC_BYTE:  	
		OUT	TWDR,OSRG
		OUTI	TWCR,1<<TWINT|1<<TWEN|0<<TWIE
 
 
IIC_B:		
		IN	OSRG,TWCR
		ANDI	OSRG,1<<TWINT	; Ждем пока передатчик пошлет байт			
		BREQ	IIC_B
		RET
 
;-----------------------------------------------------------------------------
; Принять байт. 
IIC_RCV:	
		OUTI	TWCR,1<<TWINT|1<<TWEN|1<<TWEA|0<<TWIE
IIC_R:		
		IN	OSRG,TWCR
		ANDI	OSRG,1<<TWINT			
		BREQ	IIC_R		; Ждем пока байт будет принят
		RET
 
;-----------------------------------------------------------------------------
; Принять последний байт. Помните я писал о разнице между просто байтом и последним
; байтом? В последнем байте не генерируется ACK!!!
IIC_RCV2:	OUTI	TWCR,1<<TWINT|1<<TWEN|0<<TWEA|0<<TWIE
IIC_R2:		IN	OSRG,TWCR
		ANDI	OSRG,1<<TWINT	; Ждем пока байт будет принят		
		BREQ	IIC_R2
		RET
 
;-----------------------------------------------------------------------------
; Сгенерировать STOP
IIC_STOP:	OUTI	TWCR,1<<TWINT|1<<TWSTO|1<<TWEN|0<<TWIE
 
IIC_ST:		
		IN	OSRG,TWCR
		ANDI	OSRG,1<<TWSTO			
		BREQ	IIC_ST		; Ждем пока не будет готов стоп.
		RET
;-----------------------------------------------------------------------------
